package tasks.quest1javasyntax.level1.task0110;


public class Solution {
    /*Задача: На нашем экране — переменная
    Объяви переменную name типа String.
Сразу же в строке объявления присвой ей какое-нибудь значение.
Выведи на экран переменную name.


Требования:
1. В методе main объяви переменную типа String.
2. Имя переменной должно быть name.
3. Переменной сразу должно быть присвоено значение.
4. Программа должна выводить текст на экран.
5. Выведенный текст должен быть значением переменной.
     */
    public static void main(String[] args) {
        String name="Svetlana";
        System.out.println(name);
    }

}
