package tasks.quest1javasyntax.level4.task0440;

public class Solution {
    /*
    Задача: Достойная оплата труда
Используя цикл вывести на экран сто раз надпись:
"Я никогда не буду работать за копейки. Амиго"
Каждое значение вывести с новой строки.


Требования:
1. Программа не должна считывать текст c клавиатуры.
2. Программа должна выводить текст на экран.
3. Программа должна выводить 100 раз текст указанный в задании.
4. В программе должен использоваться цикл for или цикл while.
     */

    public static void main(String[] args) {
        String s="Я никогда не буду работать за копейки. Амиго";
        for (int i=0;i<100;i++){
            System.out.println(s);
        }
    }
}
