package tasks.quest1javasyntax.level1.task0129;

public class Solution {
    /*Задание: Любимое стихотворение
    В методе main напиши код, чтобы в результате выполнения программы было выведено твое любимое стихотворение.
В стихотворении должно быть не меньше, чем 4 строчки. Не убирай вывод строчки "Мое любимое стихотворение:".

Требования:
1. Программа должна выводить текст.
2. Перед стихом должна быть выведена строка "Мое любимое стихотворение:".
3. Выводимый текст должен состоять не меньше, чем из пяти строк (пустые строки - это тоже строки).
4. В выводимом тексте должно быть не менее, чем 50 символов.

     */

    public static void main(String[] args) {
        System.out.println("Мое любимое стихотворение:");
        System.out.println("When I heard that sound\n" +
                "When the walls came down\n" +
                "I was thinking about you\n" +
                "About you\n" +
                "When my skin grows old\n" +
                "When my breath turns cold\n" +
                "I'll be thinking about you\n");
    }


}
