package tasks.quest1javasyntax.level1.task0111;

public class Solution {
    /*Задача: Одной переменной недостаточно
    Объяви переменные a, b типа int и переменную s типа String.
Сразу же в строке объявления присвой им любые разные значения.


Требования:
1. Объяви две переменные типа int.
2. Объяви одну переменную типа String.
3. Имена переменных типа int должны быть a и b.
4. Имя переменной типа String должно быть s.
5. Переменным сразу должны быть присвоены значения.
6. Переменные a и b должны иметь разные значения.
     */
    public static void main(String[] args) {
        int a=7, b=17;
        String s="Hello";
    }

}
