package tasks.quest1javasyntax.level3.task0313;


public class Solution {
    /*
    Задача: Мама мыла раму
Вывести на экран все возможные комбинации слов "Мама", "Мыла", "Раму".

Требования:
1. Программа должна выводить текст.
2. Выведенный текст должен содержать 6 строк.
3. Текст в каждой строке должен быть уникален.
4. Должны быть выведены все возможные комбинации.
     */

    public static void main(String[] args) {

        System.out.println("МамаМылаРаму");
        System.out.println("РамуМамаМыла");
        System.out.println("МылаРамуМама");
        System.out.println("МамаРамуМыла");
        System.out.println("МылаМамаРаму");
        System.out.println("РамуМылаМама");

    }


}
