package tasks.quest1javasyntax.level1.task0120;

public class Solution {
    /*Задача: Лучше поздно, чем никогда: Hello world!
    Требования:
1. Программа должна выводить текст.
2. Текст должен начинаться с "Hello".
3. Текст должен заканчиваться знаком восклицания.
4. Текст должен состоять из 12 символов, включая пробелы и знак восклицания.
5. Выводимый текст должен соответствовать заданию.
     */
    public static void main(String[] args) {
        System.out.println("Hello world!");
    }

}
