package tasks.quest1javasyntax.level3.task0317;

public class Solution {
    /*
    Задача: Путь самурая
    Выведи на экран: 日本語


Требования:
1. Программа должна выводить текст.
2. Текст должен начинаться с «日».
3. Текст должен заканчиваться на «語».
4. Текст должен состоять из 3 символов.
5. Выведенный текст должен соответствовать заданию.
     */

    public static void main(String[] args) {
        //System.out.println("日本語");
        System.out.println("\u65e5\u672c\u8a9e");


    }



}
