package tasks.quest1javasyntax.level0.task0104;

import java.time.LocalDate;

public class Solution {
    /* Задача: "Мой юный друг"
    Сейчас 3126 год. Мой друг родился 8 лет назад.
Написать программу, выводящую на экран год рождения моего друга.


Требования:
1. Программа должна выводить текст.
2. Выведенный год должен состоять из 4 цифр.
3. Век выведенного года должен быть 32 (год должен начинаться с "31").
4. Выводимый год должен соответствовать заданию.
     */

    public static void main(String[] args) {
        System.out.println(3126-8);
    }
}
