package tasks.quest1javasyntax.level0.task0103;

public class Solution {
    /*Задача: Комплимент учителю
    Написать программу, выводящую на экран надпись "Элли самая красивая" 5 раз. Каждый раз - с новой строки.

Требования:
1. Программа должна выводить текст.
2. Текст должен начинаться с «Элли».
3. Текст должен заканчиваться на «красивая».
4. Текст должен состоять из 5 строк.
5. Выводимый текст должен соответствовать заданию.
     */

    public static void main(String[] args) {
        for (int i=0;i<5;i++){
            System.out.println("Элли самая красивая");
        }

    }

}
