package tasks.quest1javasyntax.level0.task0101;

public class Solution {
    /*Задача: Амиго очень умный
    Написать программу, выводящую на экран надпись «Амиго очень умный».
Пример вывода на экран:
Амиго очень умный
     */

    public static void main(String[] args) {
        System.out.println("Амиго очень умный");
    }

}
